---
title: ExternalResourceLoadContext
classe: Autodesk.Revit.DB.ExternalResourceLoadContext
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ExternalResourceLoadContext

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `externalResourceLoadContext.IsValidObject` | Boolean |
| `LoadOperationType LoadOperationType { get; }` | `externalResourceLoadContext.LoadOperationType` | LoadOperationType |
| `Boolean CallingDocumentHasModelPath()` | `externalResourceLoadContext.CallingDocumentHasModelPath()` | Boolean |
| `Void Dispose()` | `externalResourceLoadContext.Dispose()` | Void |
| `ModelPath GetCallingDocumentModelPath()` | `externalResourceLoadContext.GetCallingDocumentModelPath()` | ModelPath |
| `ExternalResourceReference GetCurrentlyLoadedReference()` | `externalResourceLoadContext.GetCurrentlyLoadedReference()` | ExternalResourceReference |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```